app/Models/participantes.php

SELECT *
FROM `Destinos`
WHERE `Status` = 'Activo'
---
    public function consultarDestinos()
    {
        $consulta = $this->db->table($this->tableDestinos)
            ->where('Status', 'Activo')
            ->get()->getResultArray();

SELECT v.Id, v.Precio, DATE_FORMAT(v.Fecha, "%W %d %M") AS Fecha, DATE_FORMAT(v.Fecha, "%Y-%m-%d") AS FechaISO, v.Hora, (v.Asientos_Disponibles - COUNT(r.Id)) AS Asientos_Libres
FROM `Vuelos` `v`
LEFT JOIN `Reservas` `r` ON `v`.`Id` = `r`.`Vuelo_Id` AND `r`.`Estado` = "Reservado"
WHERE `v`.`Origen_Id` = '1'
AND `v`.`Estado` = 'Activo'
AND `v`.`Fecha` >= CURDATE()
GROUP BY `v`.`Id`
ORDER BY `v`.`Fecha` ASC, `v`.`Hora` ASC
---
    public function consultarFecha($Origen_Id)
    {
        $this->db->query("SET lc_time_names = 'es_ES'");

        $builder = $this->db->table('Vuelos v');
        $builder->select('v.Id, v.Precio, DATE_FORMAT(v.Fecha, "%W %d %M") AS Fecha, DATE_FORMAT(v.Fecha, "%Y-%m-%d") AS FechaISO, v.Hora, (v.Asientos_Disponibles - COUNT(r.Id)) AS Asientos_Libres', false);
        // $builder->select('v.Id, v.Precio, DATE_FORMAT(v.Fecha, "%W %d %M") AS Fecha, v.Hora, (v.Asientos_Disponibles - COUNT(r.Id)) AS Asientos_Libres', false);
        $builder->join('Reservas r', 'v.Id = r.Vuelo_Id AND r.Estado = "Reservado"', 'left');
        $builder->where('v.Origen_Id', $Origen_Id);
        $builder->where('v.Estado', 'Activo');
        $builder->where('v.Fecha >= CURDATE()');
        $builder->groupBy('v.Id');
        $builder->orderBy('v.Fecha', 'ASC');
        $builder->orderBy('v.Hora', 'ASC');


        $consulta = $builder->get()->getResultArray();

INSERT INTO `Pasajeros` (`Nombre`, `Correo`, `Telefono`, `Edad`, `Genero`, `Fecha_Registro`) VALUES ('eduardo', 'w@.com', '222', '26', 'Masculino', '2025-04-22 08:44:49')
---
    public function registrarPasajeros($nombre, $correo, $telefono, $edad, $genero)
    {
        $data = [
            'Nombre' => $nombre,
            'Correo' => $correo,
            'Telefono' => $telefono,
            'Edad' => $edad,
            'Genero' => $genero,
            'Fecha_Registro' => date('Y-m-d H:i:s'),
        ];

        $this->db->table($this->tablePasajeros)->insert($data);

INSERT INTO `Reservas` (`Vuelo_Id`, `Pasajero_Id`, `Asiento`, `Estado`, `Fecha_Reserva`) VALUES ('9', 12, 0, 'Reservado', '2025-04-22 08:44:49')
---
    public function registrarReserva($reserva = [])
    {
        if (empty($reserva)) {
            return false;
        }

        $this->db->table($this->tableReservas)->insert($reserva);

INSERT INTO `Pagos` (`Total`, `ComisionPorcentaje`, `ComisionFija`, `IVA`, `MontoTotal`, `StatusPago`, `TipoPago`, `Fecha`) VALUES ('850', 30.6, 3, 5.38, 811.02, 'Pendiente', 'Tarjeta', '2025-04-22 08:44:49')
INSERT INTO `ReservaPago` (`IdPago`, `IdReserva`) VALUES (10, 12)
---
    public function agregarReservaPago($idReservas = [], $pagoData = [])
    {
        if (empty($idReservas) || empty($pagoData)) {
            return false;
        }

        // Insertar en tabla Pagos
        $this->db->table($this->tablePagos)->insert($pagoData);
        $idPago = $this->db->insertID();

        // Insertar relación en ReservaPago
        foreach ($idReservas as $reservaId) {
            $this->db->table($this->tableReservaPagos)->insert([
                'IdPago'    => $idPago,
                'IdReserva' => $reservaId
            ]);

UPDATE `Reservas` SET `Estado` = 'Cancelado'
WHERE `Id` = 12
---
    public function cancelarReserva($idReserva, $data = [])
    {
        return $this->db->table($this->tableReservas)
            ->where('Id', $idReserva)
            ->update($data);

UPDATE `Pagos` SET `StatusPago` = 'Cancelado'
WHERE `Id` = 10
---
    public function cancelarPago($idPago, $data = [])
    {
        return $this->db->table($this->tablePagos)
            ->where('Id', $idPago)
            ->update($data);

SELECT `rp`.`Id` AS `ReservaPagoId`, `p`.`TipoPago`, `p`.`Total`, `p`.`ComisionPorcentaje`, `p`.`ComisionFija`, `p`.`IVA`, `p`.`MontoTotal`, `p`.`StatusPago`, `pas`.`Nombre`, `pas`.`Telefono`, `pas`.`Correo`, `pas`.`Edad`, `pas`.`Genero`, `ori`.`Codigo` AS `Origen_Codigo`, `ori`.`Nombre` AS `Origen_Nombre`, `des`.`Codigo` AS `Destino_Codigo`, `des`.`Nombre` AS `Destino_Nombre`, `v`.`Fecha` AS `Vuelo_Fecha`, `v`.`Hora` AS `Vuelo_Hora`
FROM `pagos` `p`
JOIN `reservaPago` `rp` ON `rp`.`IdPago` = `p`.`Id`
JOIN `reservas` `r` ON `r`.`Id` = `rp`.`IdReserva`
JOIN `vuelos` `v` ON `v`.`Id` = `r`.`Vuelo_Id`
JOIN `destinos` `ori` ON `ori`.`Id` = `v`.`Origen_Id`
JOIN `destinos` `des` ON `des`.`Id` = `v`.`Destino_Id`
JOIN `pasajeros` `pas` ON `pas`.`Id` = `r`.`Pasajero_Id`
WHERE `p`.`Id` = '1'
UPDATE `Pagos` SET `StatusPago` = 'Pagado'
WHERE `Id` = '1'
---
    public function actualizarURL($idPago)
    {
        $resultado = $this->db->table('pagos p')
            ->select(
                'rp.Id AS ReservaPagoId, p.TipoPago, p.Total, p.ComisionPorcentaje, p.ComisionFija, p.IVA, p.MontoTotal, p.StatusPago,
                pas.Nombre, pas.Telefono, pas.Correo, pas.Edad, pas.Genero,
                ori.Codigo AS Origen_Codigo, ori.Nombre AS Origen_Nombre,
                des.Codigo AS Destino_Codigo, des.Nombre AS Destino_Nombre,
                v.Fecha AS Vuelo_Fecha, v.Hora AS Vuelo_Hora'
            )
            ->join('reservaPago rp', 'rp.IdPago = p.Id')
            ->join('reservas r', 'r.Id = rp.IdReserva')
            ->join('vuelos v', 'v.Id = r.Vuelo_Id')
            ->join('destinos ori', 'ori.Id = v.Origen_Id')   // origen
            ->join('destinos des', 'des.Id = v.Destino_Id')  // destino
            ->join('pasajeros pas', 'pas.Id = r.Pasajero_Id')
            ->where('p.Id', $idPago)
            ->get()
            ->getResultArray();

        $dataPago = [
            'StatusPago' => 'Pagado',
        ];

        $this->db->table($this->tablePagos)
            ->where('Id', $idPago)
            ->update($dataPago);

SELECT *
FROM `Pagos`
WHERE `Id` = '10'
---
    public function informacionPago($id)
    {
        $resultado = $this->db->table($this->tablePagos)
            ->where('Id', $id)
            ->get()
            ->getRowArray();